# Here are some examples of Data Exploration and Manipulation

### Example 1. Loading Data

In [1]:
import pandas as pd
df=pd.read_csv("Automobile_data.csv")
print(df.head())

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

### Example 2. Displaying Basic Information

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

### Example 3. Descriptive Statistics

In [3]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

### Example 4. Selecting Columns

In [5]:
get_coloumn=df[['Age','Name']]
print(get_coloumn)

   Age     Name
0   25    Alice
1   30      Bob
2   35  Charlie

### Example 5. Filtering Data

In [7]:
filter_data=df[df['Age']>25]
print(filter_data)

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

### Example 6.Handling Missing Data:

In [10]:
df=pd.read_csv("Automobile_data.csv")
df_filled=df.fillna(0)
print(df_filled)

    Name   Age           City
0  Alice   0.0       New York
1    Bob  30.0  San Francisco
2      0  35.0    Los Angeles

### Example 7. Grouping and Aggregation

In [15]:
df=pd.read_csv("Automobile_data.csv")
grp_data=df.groupby('Name')['Age'].mean()
print(grp_data)

Name
Alice    22.0
Bob      30.0
John     35.0
Name: Age, dtype: float64

### Example 8. Adding New Columns

In [33]:
df=pd.read_csv("marks.csv")
print(df.head())

   Roll No    Name  Maths  English  scns  Hindi
0        1   Rohit     20       42    44     46
1        2    Aman     30       43    45     46
2        3  Bhavya     40       45    46     47
3        4    Raju     50       46    47     48
4        5   Tarun     50       45    49     49

In [34]:
df["Total Marks"]=df['Maths']+df['English']+df['Hindi']+df['scns']
print(df.head())

   Roll No    Name  Maths  English  scns  Hindi  Total Marks
0        1   Rohit     20       42    44     46          152
1        2    Aman     30       43    45     46          164
2        3  Bhavya     40       45    46     47          178
3        4    Raju     50       46    47     48          191
4        5   Tarun     50       45    49     49          193

### Example 9. Sorting Data

In [35]:
sort_data=df.sort_values(by='English',ascending=False)
print(sort_data)

   Roll No    Name  Maths  English  scns  Hindi  Total Marks
3        4    Raju     50       46    47     48          191
2        3  Bhavya     40       45    46     47          178
4        5   Tarun     50       45    49     49          193
1        2    Aman     30       43    45     46          164
0        1   Rohit     20       42    44     46          152

### Example 10. String Operations

In [38]:
df['Upper Case Name'] = df['Name'].str.upper()
print(df.head())

   Roll No    Name  Maths  English  scns  Hindi  Total Marks Upper Case Name
0        1   Rohit     20       42    44     46          152           ROHIT
1        2    Aman     30       43    45     46          164            AMAN
2        3  Bhavya     40       45    46     47          178          BHAVYA
3        4    Raju     50       46    47     48          191            RAJU
4        5   Tarun     50       45    49     49          193           TARUN